app/controllers/user_controller.rb

	def update_profile
		@user = current_user
		@user_detail = @user.user_detail
		if @user_detail.update_attributes(params[:user_detail])
---
UPDATE `user_details` SET `first_name` = 'joshua', `second_name` = 'watson', `contact_number` = 9941078831, `position` = 'deve', `address` = 'jlskfjskdjfkjsdf.ksjf', `updated_at` = '2013-07-08 12:18:11' WHERE `user_details`.`id` = 1